ws/resources/objectRepo/xmlTemplates/MDM/HotelConfig/req_CreateTemplateGuaranteeCode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateTemplateGuaranteeCodeRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:TemplateGuaranteeCode GuaranteeCode="?" Inactive="?" LateArrival="?" OnHold="?" OrderSequence="?" ReserveInventory="?">
            <v91:Description/>
            <v91:Requirements Address="?" ArrivalTime="?" Cancellation="?" CreditCard="?" Deposit="?" PhoneNumber="?" RequirementCode="?"/>
            <v91:ShortDescription>
               <v91:DefaultText/>
               <v91:TranslatedTexts>
                  <v91:Text Lang="?"/>
               </v91:TranslatedTexts>
            </v91:ShortDescription>
            <v91:PaymentTypes>
               <v91:CardCode/>
            </v91:PaymentTypes>
            <v91:MassCancellation AutoCancel="?" PendingDays="?"/>
         </v9:TemplateGuaranteeCode>
      </v9:CreateTemplateGuaranteeCodeRQ>
   </soapenv:Body>
</soapenv:Envelope>